# **Pandas Operations Notebook**

This notebook covers basic pandas operations.

In [1]:
# Importing pandas
import pandas as pd
import numpy as np

## **1. Creating DataFrames**

In [2]:
# Creating a DataFrame from a dictionary
data = {'Name': ['Alice', 'Bob', 'Charlie', 'David'],
        'Age': [25, 30, 35, 40],
        'Salary': [50000, 60000, 70000, 80000]}

df = pd.DataFrame(data)
df

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

## **2. Importing and Exporting Data**

In [3]:
# Saving to CSV (uncomment to run)
# df.to_csv('data.csv', index=False)

# Reading from CSV (uncomment to run)
# df = pd.read_csv('data.csv')
# df

## **3. Basic Data Operations**

In [4]:
# Viewing first few rows
df.head()

      Name  Age  Salary
0    Alice   25   50000
1      Bob   30   60000
2  Charlie   35   70000
3    David   40   80000

In [5]:
# Summary statistics
df.describe()

             Age        Salary
count   4.000000      4.000000
mean   32.500000  65000.000000
std     6.454972  12909.944487
min    25.000000  50000.000000
25%    28.750000  57500.000000
50%    32.500000  65000.000000
75%    36.250000  72500.000000
max    40.000000  80000.000000

## **4. Filtering and Sorting**

In [6]:
# Filtering data (Age > 30)
df[df['Age'] > 30]

      Name  Age  Salary
2  Charlie   35   70000
3    David   40   80000

In [7]:
# Sorting by Salary in descending order
df.sort_values(by='Salary', ascending=False)

      Name  Age  Salary
3    David   40   80000
2  Charlie   35   70000
1      Bob   30   60000
0    Alice   25   50000

## **5. Grouping and Aggregation**

In [8]:
# Grouping by Age and calculating mean Salary
df.groupby('Age')['Salary'].mean()

Age
25    50000.0
30    60000.0
35    70000.0
40    80000.0
Name: Salary, dtype: float64